*** Calc 1

#+begin_src python :results output drawer
import random
import operator
# import numpy as np
# import matplotlib as mpl
# from matplotlib import pyplot as plt

def nd6(n):
    return [random.randint(1,6) for i in range(n)]

def check(attribute, skill):
    return sum(map(lambda x: operator.le(x, skill), nd6(attribute)))

def risky_check(attribute, skill, risk):
    c = check(attribute, skill)
    if c > risk:
        c += risk
    else:
        c -= risk
    return c

def run_experiment(at_attr, at_skill, at_risk, de_attr, de_skill, de_risk, n):
    effects = 0
    passed = 0
    failed = 0
    for i in range(n):
        at = risky_check(at_attr, at_skill, at_risk)
        de = risky_check(de_attr, de_skill, de_risk)
        effect = at - de
        if effect > 0:
            passed += 1
        else:
            failed += 1
        effects += effect
    print(passed, failed, 100*float(passed) / float(passed+failed))

# # change attackers skill
# run_experiment(4, 1, 0, 4, 3, 0, 1000)
# run_experiment(4, 2, 0, 4, 3, 0, 1000)
# run_experiment(4, 3, 0, 4, 3, 0, 1000)
# run_experiment(4, 4, 0, 4, 3, 0, 1000)
# run_experiment(4, 5, 0, 4, 3, 0, 1000)
# # change defenders skill
# run_experiment(4, 3, 0, 4, 1, 0, 1000)
# run_experiment(4, 3, 0, 4, 2, 0, 1000)
# run_experiment(4, 3, 0, 4, 3, 0, 1000)
# run_experiment(4, 3, 0, 4, 4, 0, 1000)
# run_experiment(4, 3, 0, 4, 5, 0, 1000)

# # change attackers attribute
# run_experiment(1, 3, 0, 3, 3, 0, 1000)
# run_experiment(2, 3, 0, 3, 3, 0, 1000)
# run_experiment(3, 3, 0, 3, 3, 0, 1000)
# run_experiment(4, 3, 0, 3, 3, 0, 1000)
# run_experiment(5, 3, 0, 3, 3, 0, 1000)
# # change defenders attribute
# run_experiment(3, 3, 0, 1, 3, 0, 1000)
# run_experiment(3, 3, 0, 2, 3, 0, 1000)
# run_experiment(3, 3, 0, 3, 3, 0, 1000)
# run_experiment(3, 3, 0, 4, 3, 0, 1000)
# run_experiment(3, 3, 0, 5, 3, 0, 1000)

# change attackers risk
run_experiment(7, 3, 1, 7, 3, 0, 1000)
run_experiment(7, 3, 2, 7, 3, 0, 1000)
run_experiment(7, 3, 3, 7, 3, 0, 1000)
run_experiment(7, 3, 4, 7, 3, 0, 1000)
run_experiment(7, 3, 5, 7, 3, 0, 1000)
# change defenders risk
run_experiment(7, 3, 0, 7, 3, 1, 1000)
run_experiment(7, 3, 0, 7, 3, 2, 1000)
run_experiment(7, 3, 0, 7, 3, 3, 1000)
run_experiment(7, 3, 0, 7, 3, 4, 1000)
run_experiment(7, 3, 0, 7, 3, 5, 1000)



#+end_src

#+RESULTS:
:results:
(577, 423, 57.7)
(683, 317, 68.3)
(503, 497, 50.3)
(231, 769, 23.1)
(52, 948, 5.2)
(229, 771, 22.9)
(228, 772, 22.8)
(491, 509, 49.1)
(791, 209, 79.1)
(934, 66, 93.4)
:end:

*** Calc 2

Calculate the expected damage that would be done in battle

#+begin_src python :results output drawer
import random
import operator
import numpy as np
import math

def propRSuccesses(n, r, p):
    return math.factorial(n) / math.factorial(r) / math.factorial(n-r) * p**r * (1-p)**(n-r)

A = 3 # total dice for player A
B = 3 # total dice for player B
pA = 5/6 # successchance for 1 die for player A
pB = 4/6 # successchance for 1 die for player B
propMatrix = np.zeros((A,B))
propSuccA = np.array([ propRSuccesses(A, r, pA) for r in range(A+1) ])
propSuccB = np.array([ propRSuccesses(B, r, pB) for r in range(B+1) ])
propEncounter = np.outer(propSuccA, propSuccB)

def expecedDamage(propM):
    I = np.shape(propM)[0]
    J = np.shape(propM)[1]
    eDA = 0
    eDB = 0
    for i in range(I):
        for j in range(J):
            if(i > j):
                eDA += 2 * abs(i-j) * propM[i,j]
            elif(i < j):
                eDB += 2 * abs(i-j) * propM[i,j]
            else:
                pass
    return eDA, eDB

eDA, eDB = expecedDamage(propEncounter)
print("A rolls %i die with a success rate of %f" % (A, pA))
print("B rolls %i die with a success rate of %f" % (B, pB))
print("Expected damage done by player A: ", eDA)
print("Expected damage done by player B: ", eDB)
#+end_src

#+RESULTS:
:results:
A rolls 3 die with a success rate of 0.833333
B rolls 3 die with a success rate of 0.666667
Expected damage done by player A:  1.3683127572016465
Expected damage done by player B:  0.3683127572016459
:end:
